In [1]:
import numpy as np
import pandas as pd

In [2]:
ventas = pd.read_json('data/dados_vendas_clientes.json')

ventas = pd.json_normalize(ventas['dados_vendas'])
ventas.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [3]:
ventas = ventas.explode(ventas.columns.tolist()[1:])
ventas = ventas.reset_index(drop=True)
ventas.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
1    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4    07/06/2022  Isabely JOanes 738       R$ 825,31

In [4]:
ventas.dtypes

Data de venda      object
Cliente            object
Valor da compra    object
dtype: object

In [5]:
ventas['Valor da compra'] = ventas['Valor da compra'].apply(lambda p: p.replace(',', '.').replace('R$ ', '').strip())
ventas['Valor da compra'] = ventas['Valor da compra'].astype(np.float64)
ventas.dtypes

Data de venda       object
Cliente             object
Valor da compra    float64
dtype: object

In [6]:
ventas.head()

  Data de venda             Cliente  Valor da compra
0    06/06/2022     @ANA _LUCIA 321           836.50
1    06/06/2022  DieGO ARMANDIU 210           573.33
2    06/06/2022  DieGO ARMANDIU 210           392.80
3    06/06/2022  DieGO ARMANDIU 210           512.34
4    07/06/2022  Isabely JOanes 738           825.31

In [7]:
ventas['Cliente'] = ventas['Cliente'].str.lower()
ventas.head()

  Data de venda             Cliente  Valor da compra
0    06/06/2022     @ana _lucia 321           836.50
1    06/06/2022  diego armandiu 210           573.33
2    06/06/2022  diego armandiu 210           392.80
3    06/06/2022  diego armandiu 210           512.34
4    07/06/2022  isabely joanes 738           825.31

In [8]:
ventas['Cliente'] = ventas['Cliente'].str.replace('[^a-z ]', '', regex=True).str.strip()
ventas.head()

  Data de venda         Cliente  Valor da compra
0    06/06/2022       ana lucia           836.50
1    06/06/2022  diego armandiu           573.33
2    06/06/2022  diego armandiu           392.80
3    06/06/2022  diego armandiu           512.34
4    07/06/2022  isabely joanes           825.31

In [9]:
ventas['Data de venda'] = pd.to_datetime(ventas['Data de venda'], format='%d/%m/%Y')
ventas.head()

  Data de venda         Cliente  Valor da compra
0    2022-06-06       ana lucia           836.50
1    2022-06-06  diego armandiu           573.33
2    2022-06-06  diego armandiu           392.80
3    2022-06-06  diego armandiu           512.34
4    2022-06-07  isabely joanes           825.31

El objetivo de este proyecto es analizar los resultados de un evento con los clientes de una empresa de venta online. Se recopiló un conjunto de datos que contiene los clientes que gastaron más en productos dentro de los 5 días posteriores a la venta, que es la duración del evento. Este análisis identificará al cliente con la mayor compra esa semana, quien recibirá un premio de la tienda, y posteriormente, puede ayudar a la empresa a crear nuevas estrategias para atraer más clientes.

In [10]:
ventas.groupby('Cliente')['Valor da compra'].sum().sort_values(ascending=False).head()

Cliente
isabely joanes    2329.30
maria julia       2086.65
julya meireles    1643.74
diego armandiu    1478.47
paulo castro       899.16
Name: Valor da compra, dtype: float64